/*****************************************************************************************************
 * 비밀번호 비밀버호확인 일치여부
 *****************************************************************************************************/
export function passwordMatch(pw, confirmPw) {
	return pw === confirmPw;
}

/*****************************************************************************************************
 * 비밀번호확인 경고 유무     : 비밀번호확인 입력시 state 메세지 값에따른 경고출력 - [매개변수 : (비밀번호확인, 메세지 ,비밀번호확인함수)]
 *****************************************************************************************************/
export function passwordWarning(confirmPw, message, PasswordMatch) {
	if (confirmPw)
		if (message != '') return PasswordMatch() ? false : 'warning';
}
